twitter_clone/src/app/Models/Follower.php

    public function fetchFollowCount(int $userId)
    {
        return $this->where('following_id', $userId)->count();
---
select count(*) as aggregate from `followers` where `following_id` = 2