twitter_clone/src/app/Models/Tweet.php

select * from `tweets` where `user_id` = 2 and `tweets`.`deleted_at` is null order by `created_at` desc limit 50 offset 0
select count(*) as aggregate from `tweets` where `user_id` = 2 and `tweets`.`deleted_at` is null
---
    public function getUserTimeLine(int $userId)
    {
        return $this->where('user_id', $userId)->orderBy('created_at', 'DESC')->paginate(50);