twitter_clone/src/app/Models/User.php

    public function getAllUsers(int $userId)
    {
        return $this->Where('id', '<>', $userId)->paginate(5);
---
select * from `users` where `id` <> 12 limit 5 offset 0
select count(*) as aggregate from `users` where `id` <> 12